const ShareTargetModel = require('./ShareTargetModel');
const yearData = require('../../public/json/year_result');
const quarterData = require('../../public/json/quarter_result');

const data = [
{
    period: '2019.09', shareName: 'LG디스플레이', shareCode: '034220', marketName: '디스플레이패널', marketCode: '222', '매출액QoQ(%)': '8.75', 매출액: '58217', '영업이익QoQ(%)': '-18.44', 영업이익: '-4367', '당기순이익QoQ(%)': '19.63', 당기순이익: '-4422', 영업이익률: '-7.50', 순이익률: '-7.60', 'ROE(지배주주)': '-6.55', 부채비율: '161.37', 당좌비율: '75.48', 유보율: '640.14', 'EPS(원)': '-1172', 'PER(배)': '-5.74', 'BPS(원)': '36730', 'PBR(배)': '0.39', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2019.12', shareName: 'LG디스플레이', shareCode: '034220', marketName: '디스플레이패널', marketCode: '222', '매출액QoQ(%)': '10.31', 매출액: '64217', '영업이익QoQ(%)': '3.39', 영업이익: '-4219', '당기순이익QoQ(%)': '-310.92', 당기순이익: '-18171', 영업이익률: '-6.57', 순이익률: '-28.30', 'ROE(지배주주)': '-22.35', 부채비율: '184.86', 당좌비율: '74.37', 유보율: '545.22', 'EPS(원)': '-5033', 'PER(배)': '-2.05', 'BPS(원)': '31694', 'PBR(배)': '0.51', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2020.03', shareName: 'LG디스플레이', shareCode: '034220', marketName: '디스플레이패널', marketCode: '222', '매출액QoQ(%)': '-26.43', 매출액: '47242', '영업이익QoQ(%)': '14.22', 영업이익: '-3619', '당기순이익QoQ(%)': '89.05', 당기순이익: '-1989', 영업이익률: '-7.66', 순이익률: '-4.21', 'ROE(지배주주)': '-23.33', 부채비율: '185.64', 당좌비율: '69.81', 유보율: '534.00', 'EPS(원)': '-556', 'PER(배)': '-1.34', 'BPS(원)': '31773', 'PBR(배)': '0.35', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2020.06', shareName: 'LG디스플레이', shareCode: '034220', marketName: '디스플레이패널', marketCode: '222', '매출액QoQ(%)': '12.34', 매출액: '53070', '영업이익QoQ(%)': '-42.86', 영업이익: '-5170', '당기순이익QoQ(%)': '-153.29', 당기순이익: '-5038', 영업이익률: '-9.74', 순이익률: '-9.49', 'ROE(지배주주)': '-23.86', 부채비율: '189.69', 당좌비율: '69.60', 유보율: '506.60', 'EPS(원)': '-1367', 'PER(배)': '-1.40', 'BPS(원)': '30335', 'PBR(배)': '0.37', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2020.09', shareName: 'LG디스플레이', shareCode: '034220', marketName: '디스플레이패널', marketCode: '222', 매출액: '67376', '매출액QoQ(%)': '26.96', 영업이익: '1644', '영업이익QoQ(%)': '131.8', 당기순이익: '111', '당기순이익QoQ(%)': '102.2', 영업이익률: '2.44', 순이익률: '0.17', 'ROE(지배주주)': '-20.43', 부채비율: '191.58', 당좌비율: '75.87', 유보율: '508.26', 'EPS(원)': '85', 'PER(배)': '-2.23', 'BPS(원)': '30549', 'PBR(배)': '0.50', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2019.06', shareName: 'LG상사', shareCode: '001120', marketName: '무역회사와판매업체', marketCode: '226', 매출액: '26151', '매출액QoQ(%)': '', 영업이익: '506', '영업이익QoQ(%)': '', 당기순이익: '1016', '당기순이익QoQ(%)': '', 영업이익률: '1.93', 순이익률: '3.89', 'ROE(지배주주)': '13.73', 부채비율: '222.18', 당좌비율: '86.12', 유보율: '589.67', 'EPS(원)': '2283', 'PER(배)': '4.06', 'BPS(원)': '34156', 'PBR(배)': '0.52', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2019.09', shareName: 'LG상사', shareCode: '001120', marketName: '무역회사와판매업체', marketCode: '226', '매출액QoQ(%)': '5.53', 매출액: '27598', '영업이익QoQ(%)': '-42.29', 영업이익: '292', '당기순이익QoQ(%)': '-91.14', 당기순이익: '90', 영업이익률: '1.06', 순이익률: '0.33', 'ROE(지배주주)': '11.94', 부채비율: '211.03', 당좌비율: '87.98', 유보율: '590.71', 'EPS(원)': '51', 'PER(배)': '4.47', 'BPS(원)': '34798', 'PBR(배)': '0.49', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2019.12', shareName: 'LG상사', shareCode: '001120', marketName: '무역회사와판매업체', marketCode: '226', '매출액QoQ(%)': '-5.31', 매출액: '26133', '영업이익QoQ(%)': '-94.18', 영업이익: '17', '당기순이익QoQ(%)': '-2485.56', 당기순이익: '-2147', 영업이익률: '0.06', 순이익률: '-8.22', 'ROE(지배주주)': '2.48', 부채비율: '214.86', 당좌비율: '90.00', 유보율: '515.19', 'EPS(원)': '-3727', 'PER(배)': '20.41', 'BPS(원)': '30303', 'PBR(배)': '0.50', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2020.03', shareName: 'LG상사', shareCode: '001120', marketName: '무역회사와판매업체', marketCode: '226', '매출액QoQ(%)': '-6.26', 매출액: '24498', '영업이익QoQ(%)': '2835.29', 영업이익: '499', '당기순이익QoQ(%)': '225.99', 당기순이익: '2705', 영업이익률: '2.04', 순이익률: '11.04', 'ROE(지배주주)': '15.42', 부채비율: '198.14', 당좌비율: '97.99', 유보율: '642.15', 'EPS(원)': '6629', 'PER(배)': '1.75', 'BPS(원)': '36390', 'PBR(배)': '0.25', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2020.06', shareName: 'LG상사', shareCode: '001120', marketName: '무역회사와판매업체', marketCode: '226', '매출액QoQ(%)': '-5.82', 매출액: '23073', '영업이익QoQ(%)': '-39.28', 영업이익: '303', '당기순이익QoQ(%)': '-92.2', 당기순이익: '211', 영업이익률: '1.31', 순이익률: '0.92', 'ROE(지배주주)': '8.74', 부채비율: '199.85', 당좌비율: '99.39', 유보율: '644.70', 'EPS(원)': '124', 'PER(배)': '5.05', 'BPS(원)': '37515', 'PBR(배)': '0.41', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  }, {
    period: '2020.09', shareName: 'LG상사', shareCode: '001120', marketName: '무역회사와판매업체', marketCode: '226', 매출액: '31552', '매출액QoQ(%)': '36.75', 영업이익: '349', '영업이익QoQ(%)': '15.18', 당기순이익: '413', '당기순이익QoQ(%)': '95.73', 영업이익률: '1.11', 순이익률: '1.31', 'ROE(지배주주)': '10.31', 부채비율: '209.63', 당좌비율: '100.53', 유보율: '657.65', 'EPS(원)': '643', 'PER(배)': '4.21', 'BPS(원)': '38555', 'PBR(배)': '0.40', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  },  {
    period: '2019.06', shareName: 'LG디스플레이', shareCode: '034220', marketName: '디스플레이패널', marketCode: '222', 매출액: '53534', '매출액QoQ(%)': '', 영업이익: '-3687', '영업이익QoQ(%)': '', 당기순이익: '-5502', '당기순이익QoQ(%)': '', 영업이익률: '-6.89', 순이익률: '-10.28', 'ROE(지배주주)': '-3.35', 부채비율: '141.71', 당좌비율: '62.71', 유보율: '663.66', 'EPS(원)': '-1533', 'PER(배)': '-13.89', 'BPS(원)': '37794', 'PBR(배)': '0.47', '주당배당금(원)': '', '시가배당률(%)': '', '배당성향(%)': '',
  },
];

const shareTargetModel = new ShareTargetModel(yearData, quarterData);
const tgShares = shareTargetModel.getTurnAroundModel();

console.log(tgShares);
